driver-tests/bpelse/misc/MiscJbi/test/MyHelloService/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://stc.com/services/soapHeaderUsage">
  <soapenv:Header>
    <soap:headerObj>
      <soap:hello1>First</soap:hello1>
      <soap:hello2>Input</soap:hello2>
    </soap:headerObj>
  </soapenv:Header>
  <soapenv:Body>
    <soap:helloObj>
      <soap:hello1>Second</soap:hello1>
      <soap:hello2>Input</soap:hello2>
    </soap:helloObj>
  </soapenv:Body>
</soapenv:Envelope>