driver-tests/bpelse/misc/MiscJbi/test/MyHelloService/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <headerObj xmlns="http://stc.com/services/soapHeaderUsage">
      <hello1>First</hello1>
      <hello2>Input</hello2>
    </headerObj>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <helloObj xmlns="http://stc.com/services/soapHeaderUsage">
      <hello1>Second</hello1>
      <hello2>Input</hello2>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
